In [2]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

# 5.1 pandas 자료 구조 소개

## 5.1.1 Series

In [3]:
obj = Series([4, 7, -5, 3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [10]:
obj2['a']

-5

In [11]:
obj2['d'] = 6

In [12]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [13]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [14]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [15]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [16]:
'b' in obj2

True

In [17]:
'e' in obj2

False

In [18]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [19]:
obj3 = Series(sdata)

In [20]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [21]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [22]:
obj4 = Series(sdata, index=states)

In [23]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [24]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [26]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [28]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [29]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [30]:
obj4.name = 'population'

In [31]:
obj4.index.name = 'state'

In [32]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [33]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [34]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## 5.1.2 DataFrame

In [35]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [36]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [37]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [38]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                  index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [39]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [40]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [41]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [42]:
frame2.ix['three']

C:\Users\Yulma\Anaconda2\envs\python36\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [43]:
frame2['debt'] = 16.5

In [44]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [45]:
frame2['debt'] = np.arange(5.)

In [46]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [47]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [48]:
frame2['debt'] = val

In [49]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [50]:
frame2['eastern'] = frame2.state == 'Ohio'

In [51]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [52]:
del frame2['eastern']

In [53]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [54]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [55]:
frame3 = DataFrame(pop)

In [56]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [57]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [58]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [59]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}

In [60]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [65]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [67]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [68]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

DataFrame 생성자에서 사용 가능한 입력 데이터

형|설명
:---|:---
2차원 ndarray|데이터를 담고 있는 행렬. 선택적으로 로우와 칼럼의 이름을 전달할 수 있다.
배열, 리스트, 튜플의 사전 | 사전의 모든 항목은 같은 길이를 가져야 하며, 각 항목의 내용이 DataFrame의 칼럼이 된다.
NumPy의 구조화 배열 | 배열의 사전과 같은 방식으로 취급된다.
Series 사전 | Series의 각 값이 칼럼이 된다. 명시적으로 색인을 남겨주지 않으면 각 Series의 색인이 하나로 합쳐져서 로우의 색인이 된다.
사전의 사전 | 내무에 있는 사전이 칼럼이 된다. 키 값은 'Series의 사전'과 마찬가지로 합쳐져 로우의 색인이 된다.
사전이나 Series의 리스트 | 리스트의 각 항목이 DataFrame의 로우가 된다. 합쳐진 사전의 키 값이나 Series의 색인이 DataFrame 칼럼의 이름이 된다.
리스트나 튜플의 리스트 | '2차원 ndarray'와 같은 방식으로 취급된다.
다른 DataFrame | 색인이 따로 지정되지 않는다면 DataFrmae의 색인이 그대로 사용된다.
NumPy MaskedArray | '2차원 ndarray'와 같은 방식으로 취급되지만 마스크 값은 반환되는 DataFrmae에서 NA값이 된다.

## 5.1.3 색인 객체

In [70]:
obj = Series(range(3), index = ['a', 'b', 'c'])

In [71]:
index = obj.index

In [72]:
index

Index(['a', 'b', 'c'], dtype='object')

In [73]:
index[1:]

Index(['b', 'c'], dtype='object')

In [75]:
index[1] = 'd' # 색인(index) 개체는 변경할 수 없다

TypeError: Index does not support mutable operations

In [76]:
index = pd.Index(np.arange(3))

In [77]:
obj2 = Series([1.5, -2.5, 0], index = index)

In [78]:
obj2.index is index

True

pandas의 주요 Index 객체

클래스 | 설명
:---|:---
Index | 가장 일반적인 Index 객체이며, 파이썬 객체의 NumPy 배열 형식으로 축의 이름을 표현한다.
Int64Index | 정수 값을 위한 특수한 Index
MultiIndex | 단일 축에 여러 단계의 색인을 표현하는 계층적 색인 객체, 튜플의 배열과 유사하다고 볼 수 있다.
DatetimeIndex | 나노초 차임스탬프를 저장한다(NumPy의 datetime64 dtype으로 표현된다).
PeriodIndex | 기간 데이터를 위한 특수한 Index

In [79]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [81]:
'Ohio' in frame3.columns

True

In [82]:
2003 in frame3.index

False

색인 메서드와 속성

메서드 | 설명
:---|:---
append | 추가적인 Index 객체를 덧붙여 새로운 색인을 반환한다.
diff | 색인의 차집합을 반환한다.
intersection | 색인의 교집합을 반환한다.
union | 색인의 합집합을 반환한다,
isin | 넘겨받은 갓이 해당 색인 위치에 존재하는지 알려주는 불리언 배열을 반환한다.
delete | i 위치의 색인이 삭제된 새로운 색인을 반환한다.
drop | 넘겨받은 값이 삭제된 새로운 색인을 반환한다.
insert | i 위치에 값이 추가된 새로운 색인을 반환한다.
is_monotonic | 색인이 단조성을 가진다면 True를 반환한다.
is_unique | 중복되는 색인이 없다면 True를 반환한다.
unique | 색인에서 중복되는 요소를 제거하고 유일한 값만을 반환한다.

# 5.2 핵심 기능

## 5.2.1 재색인

In [83]:
obj = Series([4.5, 7.2, -5.3, 3.6], index = ('d', 'b', 'a', 'c'))

In [84]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [86]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e']) # 새로운 색인에 맞게 재배열, 없는 색인값은 비어있는 값을 새로 추가

In [87]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [89]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value = 0) # fill_value 누락된 값을 채워넣음

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [90]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [92]:
obj3.reindex(range(6), method = 'ffill') # ffill 앞의 값으로 누락된 값을 채워 넣음

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

reindex 메서드(보간) 옵션

인자 | 설명
:---|:---
ffill 또는 pad | 앞의 값으로 채워 넣는다.
bfill 또는 backfill | 뒤의 값으로 채워 넣는다.

In [114]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index = ['a', 'c', 'd'], columns = ['Ohio', 'Texas', 'California'])

In [115]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [116]:
frame2 = frame.reindex(index = ['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [117]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [120]:
frame.reindex(index = ['a', 'b', 'c', 'd'],  method = 'ffill', columns = states)

ValueError: index must be monotonic increasing or decreasing

In [121]:
frame.ix[['a', 'b', 'c', 'd'], states]

C:\Users\Yulma\Anaconda2\envs\python36\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

재색인 함수 인자

인자 | 설명
:---|:---
index | 색인으로 사용할 새로운 순서. Index 인스턴스나 다른 순차적인 자료 구조를 사용할 수 있다. 색인은 복사가 이루어지지 않고 그대로 사용된다.
method | 보간 메서드
fill_value | 재색인 과정 중에 새롭게 나타나는 비어있는 데이터를 채우기 위한 값
limit | 전/후 보간시에 사용할 최대 갭 크기
level | MultiIndex 단계(level)에 단순 색인을 맞춘다. 그렇지 않으면 MultiIndex의 하위 부분집합에 맞춘다.
copy | True인 경우 새로운 색인이 이전 색인과 같더라도 데이터를 복사한다. False라면 두 색인이 같을 경우 데이터를 복사하지 않는다.

## 5.2.2 하나의 로우 또는 칼럼 삭제하기

In [3]:
obj = Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e'])

In [4]:
new_obj = obj.drop('c')

In [5]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [6]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [7]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                columns = ['one', 'two', 'three', 'four'])

In [9]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [10]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [11]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

## 5.2.3 색인하기, 선택하기, 거르기

In [12]:
obj = Series(np.arange(4.), index = ['a', 'b', 'c', 'd'])

In [14]:
obj['b']

1.0

In [15]:
obj[1]

1.0

In [16]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [18]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [19]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [20]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [21]:
obj['b':'c'] # 라벨 이름으로 슬라이싱하는 것은 시작점과 끝점을 포함한다

b    1.0
c    2.0
dtype: float64

In [22]:
obj['b':'c'] = 5

In [23]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [24]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [25]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [26]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [27]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [28]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [29]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [30]:
data[data < 5] = 0

In [31]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [32]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [33]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [34]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [39]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [40]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

DataFrame의 값 선택하기

방식 | 설명
:---|:---
obj[val] | DataFrame에서 하나의 칼럼 또는 여러 칼럼을 선택한다. 편의를 위해 불리언 배열, 슬라이스, 불리언 DataFrame(어떤 기준에 근거해서 값을 대입해야 할 때)을 사용할 수 있다.
obj.ix[val] | DataFrame에서 로우의 부분집합을 선택한다.
obj.ix[:, val] | DataFrame에서 칼럼의 부분집합을 선택한다.
obj.ix[val1. val2] | DataFrame에서 로우와 칼럼의 부분집합을 선택한다.
reindex  메서드 | 하나 이상의 축을 새로운 색인으로 맞춘다.
xs 메서드 | 라벨 이름으로 단일 로우나 칼럼으로 Series 형식으로 선택한다.
icol, irow 메서드 | 각각 정수 색인으로 단이 ㄹ로우나 칼럼을 Series 형식으로 선택한다.
get_value, set_value 메서드 | 로우와 칼럼 이름으로 DataFrame의 값을 선택한다.

## 5.2.4 산술연산과 데이터 정렬

In [41]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index = ['a', 'c', 'd', 'e'])

In [42]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index = ['a', 'c', 'e', 'f', 'g'])

In [43]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [44]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [45]:
s1 + s2 # 서로 겹치는 색인이 없마녕 데이터는 NA 값이 된다.

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [46]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns = list('bcd'), index=['Ohio', 'Texas', 'Colorado'])

In [50]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns = list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [51]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [52]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [53]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

**산술연산 메서드에 채워 넣을 값 지정하기**

In [54]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns = list('abcd'))

In [55]:
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns = list('abcde'))

In [56]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [57]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [59]:
df1 + df2 # 겹치지 않는 부분의 값은 NA가 된다.

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [60]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [61]:
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

산술연산 메서드

메서드 | 설명
:---|:---
add | 덧셈(+)을 위한 메서드
sub | 뺄셈(-)을 위한 메서드
div | 나눗셈(/)을 위한 메서드
mul | 곱셈(*)을 위한 메서드

**DataFrame과 Series 간의 연산**

In [62]:
arr = np.arange(12.).reshape((3, 4))

In [64]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [65]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [66]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [4]:
frame = DataFrame(np.arange(12.).reshape((4, 3)),
                  columns = list('bde'),
                  index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [5]:
series = frame.ix[0]

C:\Users\Yulma\Anaconda2\envs\python36\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

In [6]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [7]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [8]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [12]:
series2 = Series(range(3), index = ['b', 'e', 'f'])

In [10]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [13]:
series3 = frame['d']

In [14]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [15]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [25]:
frame.sub(series3,axis=0) # axis=0 로우를 따라 연산을 수행

                b          d         e
Utah    -0.078876  -1.517146 -1.576592
Ohio    -4.218964  -5.177746 -5.351754
Texas   -7.927719  -8.839850 -6.646349
Oregon -11.257035 -10.420957 -9.627652

## 5.2.5 함수 적용과 매핑

In [18]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                 index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.921124 -0.517146 -0.576592
Ohio   -0.218964 -1.177746 -1.351754
Texas  -0.927719 -1.839850  0.353651
Oregon -1.257035 -0.420957  0.372348

In [29]:
np.abs(frame) # NumPy의 유니버설 함수(배열의 각 원소에 적용되는 메서드)를 적용할 수 있다.

               b         d         e
Utah    0.921124  0.517146  0.576592
Ohio    0.218964  1.177746  1.351754
Texas   0.927719  1.839850  0.353651
Oregon  1.257035  0.420957  0.372348

In [19]:
f = lambda x: x.max() - x.min()

In [30]:
frame.apply(f) # apply메서드를 통해 연산 가능

            b         d         e
min -1.257035 -1.839850 -1.351754
max  0.921124 -0.420957  0.372348

In [21]:
frame.apply(f, axis = 1)

Utah      1.497715
Ohio      1.132790
Texas     2.193502
Oregon    1.629383
dtype: float64

In [22]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [23]:
frame.apply(f)

            b         d         e
min -1.257035 -1.839850 -1.351754
max  0.921124 -0.420957  0.372348

In [26]:
format = lambda x: '%.2f' % x

In [28]:
frame.applymap(format) # applymap인 이유는 Series가 각 원소에 적용할 함수를 지정하기 위한 map메서드를 가지고 있기 때문

            b      d      e
Utah     0.92  -0.52  -0.58
Ohio    -0.22  -1.18  -1.35
Texas   -0.93  -1.84   0.35
Oregon  -1.26  -0.42   0.37

In [31]:
frame['e'].map(format)

Utah      -0.58
Ohio      -1.35
Texas      0.35
Oregon     0.37
Name: e, dtype: object

## 5.2.6 정렬과 순위

In [32]:
obj = Series(range(4), index = ['d', 'a', 'b', 'c'])

In [45]:
obj.sort_index() # sort_index(): 로우나 칼럼의 색인으로 정렬

0    4
1    7
2   -3
3    2
dtype: int64

In [34]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index = ['three', 'one'], columns = ['d', 'a', 'b', 'c'])

In [35]:
frame.sort_index() # 로우를 정렬

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [38]:
frame.sort_index(axis = 1) # 칼럼을 정렬

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [40]:
frame.sort_index(axis = 1, ascending = False) # ascending = False 내림차순으로 정렬

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [42]:
obj = Series([4, 7, -3, 2])

In [44]:
obj.sort_values() # sort_values(): Series 객체를 값에 따라 정렬

2   -3
3    2
0    4
1    7
dtype: int64

In [46]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])

In [49]:
obj.sort_values() # 비어있는 값은 마지막에 위치

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [50]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [51]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [53]:
frame.sort_values(by='b') # 칼럼이 여러개 일때, 기준으로 삼을 칼럼을 by옴셥으로 지정

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [54]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [55]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [56]:
obj.rank() # 동점인 항목에 대해서는 평균 순위를 매긴다

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [58]:
obj.rank(method = 'first') # 동점인 항목을 데이터상에 나타나는 순서에 따라 순위를 매길 수도 있다.

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [66]:
obj.rank(ascending = False, method = 'max') # 내림차순도 가능, max: 동점인 항목 하위 등수로 표시, min 동점인 항목 상위 등수로 표시

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [67]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})

In [68]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [69]:
frame.rank(axis = 1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

순위의 동률을 처리하는 메서드

메서드 | 설명
:---:|:---
'average' | 기본값: 값은 값을 가지는 항목의 평균 값을 순위로 삼는다.
'min' | 같은 값을 가지는 그룹을 (값이) 낮은 순위로 매긴다.(상위 등수)
'max' | 같은 값을 가지는 그룹을 (값이) 높은 순위로 매긴다.(하위 등수)
'first' | 데이터 내에서 위치에 따라 순위를 매긴다.

## 5.2.7 중복 색인

In [72]:
obj = Series(range(5), index = ['a', 'a', 'b', 'b', 'c'])

In [73]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [75]:
obj.index.is_unique # 해당 값이 유일한지 아닌지 알려줌

False

In [76]:
obj['a']

a    0
a    1
dtype: int32

In [77]:
obj['c']

4

In [90]:
df = DataFrame(np.random.randn(4, 3), index = ['a', 'a', 'b', 'b'])

In [91]:
df

          0         1         2
a -0.655168 -2.056303 -0.968163
a -0.853593 -0.453441 -1.075713
b  0.910885  0.799113  0.896275
b  1.174850 -0.178333 -1.087862

In [92]:
df.ix['b']

C:\Users\Yulma\Anaconda2\envs\python36\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

          0         1         2
b  0.910885  0.799113  0.896275
b  1.174850 -0.178333 -1.087862

# 5.3 기술통계 계산과 요약

In [2]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
              index = ['a', 'b', 'c', 'd'], columns = ['one', 'two'])

In [3]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [6]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [8]:
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [9]:
df.mean(axis = 1, skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

축소 메서드 옵션

옵션 | 설명
:---:|:---
axis | 연산을 수행할 축. DataFrame에서 0은 로우고 1은 칼럼이다.
skipna | 누락된 값을 제외할 것인지 정하는 옵션, 기본 값은 True
level | 계산하려는 축이 계층적 색인(다중 색인)이라면 레벨에 따라 묶어서 계산한다.

In [10]:
df.idxmax()

one    b
two    d
dtype: object

In [11]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [12]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [13]:
obj = Series(['a', 'a', 'b', 'c'] * 4)

In [15]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

기술통계와 요약통계

메서드 | 설명
:---|:---
count | NA 값을 제외한 값의 수를 반환한다.
describe | Series나 DataFrame의 각 칼럼에 대한 요약통계를 계산한다.
min, max | 최소, 최대 값을 계산한다.
argmin, argmax | 각각 최소, 최대 값을 갖고 있는 색인의 위치(정수)를 반환한다.
idxmin, idxmax | 각각 최소, 최대 값을 갖고 있는 색인의 값을 반환한다.
quantile | 0부터 1까지의 분위수를 계산한다.
sum | 합을 계산한다.
mean | 평균을 계산한다.
median | 중간 값(50% 분위)을 반환한다.
mad | 평균 값에서 절대 평균편차를 구한다.
var | 표본 분산의 값을 구한다.
std | 표본 정규 분산의 값을 구한다.
skew | 표본 비대칭도(3차 적률)의 값을 구한다.
kurt | 표본 첨도(4차 적률)의 값을 구한다.
cumsum | 누적 합을 구한다.
cummin, cummax | 각각 누적 최소 값과 누적 최대 값을 계산한다.
cumprod | 누적 곱을 구한다.
diff | 1차 산술 차를 구한다(시계열 데이터 처리 시 유용하다).
pct_change | 퍼센트 변화률을 계산한다.

## 5.3.1 상관관계와 공분산

In [13]:
import pandas as pd
from pandas_datareader import data

In [14]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = data.DataReader(ticker, 'google', '2015-01-01', '2016-01-01')

In [15]:
price = pd.DataFrame({tic: data['Adj Close'] for tic, data in all_data.items()})
volume = pd.DataFrame({tic: data['volume'] for tic, data in all_data.items()})

KeyError: 'Adj Close'

In [16]:
returns = price.pct_change()